# VerticalImageScale Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..VerticalImageScale Property
ViewDisplayBackground Class See Also
---
The vertical scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double VerticalImageScale { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VerticalImageScale As Double
	Get
```

Visual C++
---
```text
public:
property double VerticalImageScale {
	double get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace